Repository: michaelbeijer/TermLens
Catalog: Example project (patent, en-nl)/Example project (patent, en-nl)_backup.tmx
Source language: en
Languages: nl

source: MASHUP APPLICATION PROCESSING SYSTEM
nl: MASHUP-APPLICATIEVERWERKINGSSYSTEEM

source: FIELD OF THE INVENTION
nl: GEBIED VAN DE UITVINDING

source: The present invention relates generally to information processing systems and more particularly to a methodology and implementation for enabling an improved processing system for Mashup applications.
nl: De onderhavige uitvinding heeft in het algemeen betrekking op informatieverwerkingssystemen en meer in het bijzonder op een methodologie en implementatie voor het mogelijk maken van een verbeterd verwerkingssysteem voor mashup-applicaties.

source: BACKGROUND OF THE INVENTION
nl: ACHTERGROND VAN DE UITVINDING

source: In network web development, a mashup is a Web application that combines data from one or more sources into a single integrated tool.
nl: Bij netwerk-webontwikkeling is een mashup een webapplicatie die gegevens van een of meer bronnen combineert in één geïntegreerde tool.

source: The term Mashup implies easy, fast integration, frequently done by access to open application programming interfaces or APIs and data sources to produce results that were not the original reason for producing the raw Source data.
nl: De term Mashup impliceert gemakkelijke, snelle integratie, vaak tot stand gebracht door toegang tot open application programming interfaces of API's en gegevensbronnen, om resultaten te produceren die niet de oorspronkelijke reden waren voor het produceren van de onbewerkte brongegevens.

source: An example of a mashup is the use of cartographic data from a mapping program to add location information to real estate or restaurant data, thereby creating a new and distinct Web service that was not originally provided by either source.
nl: Een voorbeeld van een mashup is het gebruik van cartografische gegevens van een kaartprogramma om locatie-informatie toe te voegen aan vastgoed- of restaurantgegevens, waardoor een nieuwe en afzonderlijke webservice ontstaat die oorspronkelijk niet door een van beide bronnen werd geleverd.

source: Mashups are increasingly being used as an enabling technology or richer portals for building enterprise applications.
nl: Mashups worden steeds vaker gebruikt als faciliterende technologie of rijkere portals voor het bouwen van bedrijfsapplicaties.

source: The basic components of the mashup are widgets and wirings.
nl: De basiscomponenten van de mashup zijn widgets en verbindingen.

source: A widget consists of an embeddable piece of web user inter face (UI) function that can communicate with other widgets through “events’.
nl: Een widget bestaat uit een inbedbaar stukje webgebruikersinterface (UI)-functionaliteit dat kan communiceren met andere widgets via 'events'.

source: A wire is a communication link between two or more widgets.
nl: Een verbinding is een communicatielink tussen twee of meer widgets.

source: A mashup consists of a definition of widget layout, widget configurations, and wirings.
nl: Een mashup bestaat uit een definitie van widgetlay-out, widgetconfiguraties en verbindingen.

source: One key tenet of the mashup environment is that the user is empowered to completely customize the UI, including contents, configurations, and wirings.
nl: Een belangrijk principe van de mashup-omgeving is dat de gebruiker de bevoegdheid heeft om de UI volledig aan te passen, inclusief inhoud, configuraties en verbindingen.

source: This creates a challenge within environments where the designer of a set of widgets and predetermined page content wishes to enable scenarios that cross between multiple page boundaries.
nl: Dit creëert een uitdaging binnen omgevingen waar de ontwerper van een set widgets en vooraf bepaalde pagina-inhoud scenario's wil mogelijk maken die over meerdere paginagrenzen heen gaan.

source: However, the designer cannot link directly between two pages in predetermined content without violating the mashup principle: that page may no longer exist in the user's display environment or may have been completely customized from its original contents.
nl: De ontwerper kan echter niet rechtstreeks een link leggen tussen twee pagina's in vooraf bepaalde inhoud zonder het mashup-principe te schenden: die pagina bestaat mogelijk niet meer in de weergaveomgeving van de gebruiker of is mogelijk volledig aangepast ten opzichte van de oorspronkelijke inhoud.

source: Mashups are very loosely coupled components.
nl: Mashups zijn zeer losjes gekoppelde componenten.

source: The components may come from the same provider (in which case, that provider envisioned how they might work together) or may come from different providers.
nl: De componenten kunnen afkomstig zijn van dezelfde aanbieder (in welk geval die aanbieder voor ogen had hoe ze zouden kunnen samenwerken) of kunnen afkomstig zijn van verschillende aanbieders.

source: Since the user creates the content and assembles their own user interface (UI), navigation between widgets cannot be assumed since it is not known how the user will structure the application.
nl: Aangezien de gebruiker de inhoud creëert en hun eigen gebruikersinterface (UI) samenstelt, kan navigatie tussen widgets niet worden aangenomen, aangezien het niet bekend is hoe de gebruiker de applicatie zal structureren.

source: Also, the user may have added their own custom pages and would like those pages to participate in the cross-page inter actions.
nl: Ook kan de gebruiker eigen aangepaste pagina's hebben toegevoegd en wil hij dat die pagina's deelnemen aan de interacties tussen pagina's.

source: Finally, because these widgets are assembled in a loosely coupled fashion, a user interface paradigm is needed to indicate what information may have possible interactions with other pages.
nl: Ten slotte, omdat deze widgets op een losjes gekoppelde manier zijn samengesteld, is een gebruikersinterfaceparadigma nodig om aan te geven welke informatie mogelijke interacties kan hebben met andere pagina's.

source: Thus, there is a need to provide a data input system which is effective to enable computerized device users to quickly customize pages in a mashup application.
nl: Daarom is er behoefte aan een gegevensinvoersysteem dat effectief is om gebruikers van geautomatiseerde apparaten in staat te stellen snel pagina's aan te passen in een mashup-applicatie.
